posts/build2learn_25_itr.html
<!DOCTYPE html><html><head><!-- 2025-03-22 --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>25th Build2Learn Hackathon project</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
This time instead of creating project i want to write a book about
understanding programming concepts.
</p>

<p>
The book is currently developed in the following github
<a href="https://github.com/ThangaAyyanar/understand-programs">https://github.com/ThangaAyyanar/understand-programs</a>
</p>

<p>
I would like to thank Muthu from Pailagam &amp;&amp; other build2learn members
for give me pointers in few chapters.
</p>

<p>
This book is aimed at beginners who understand little bit about
programming but fears when they see a program with nested loops,
recursion and algorithms.
</p>

<p>
So far i am able to write a draft for 3 chapters. Plan to write
atleast 5 chapters within end of this week
</p>

<p>
Future plans will be to seperate code and concepts so that a script
can be used to generate a book for programming language
</p>

<p>
Reason i started writing this book is to take note of tips and tricks
i have used during my learning phase and share it with others. Other
reason would be to learn more tips and tricks from other people
</p>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
